In [17]:
import pandas as pd
marathon = pd.read_csv('/home/alysha/repos/Python_Practice/marathon_small.csv')
marathon

,age,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes,sex
0,16.0,18.330755,945.0,2040.0,34.000000,male
1,16.0,19.135529,1110.0,2365.0,39.416667,male
2,16.0,19.476656,985.0,2055.0,34.250000,male
3,16.0,18.330755,1146.0,NaN,NaN,male
4,16.0,22.263451,NaN,2459.0,40.983333,male
...,...,...,...,...,...,...
1828,60.0,19.531250,1665.0,3550.0,59.166667,female
1829,62.0,27.363125,1956.0,4014.0,66.900000,female
1830,62.0,24.431360,2280.0,NaN,NaN,female
1831,63.0,21.036816,NaN,4140.0,69.000000,female
1832,67.0,23.218958,1262.0,NaN,NaN,female

Hurrah! - .shape gives the row/column

In [18]:
marathon.shape

(1833, 6)

.head() gives the first five rows in the data frame

In [19]:
marathon.head()

,age,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes,sex
0,16.0,18.330755,945.0,2040.0,34.000000,male
1,16.0,19.135529,1110.0,2365.0,39.416667,male
2,16.0,19.476656,985.0,2055.0,34.250000,male
3,16.0,18.330755,1146.0,NaN,NaN,male
4,16.0,22.263451,NaN,2459.0,40.983333,male

.loc[] or rather .loc[5:10] will give the rows in the data frame located from 5 to 10

In [20]:
marathon.loc[5:10]

,age,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes,sex
5,16.0,18.934912,1164.0,NaN,NaN,male
6,16.0,21.153549,1122.0,NaN,NaN,male
7,16.0,21.385611,1024.0,1602.0,26.700000,male
8,16.0,22.913443,1265.0,2918.0,48.633333,male
9,16.0,17.557827,1131.0,NaN,NaN,male
10,16.0,19.858318,1082.0,NaN,NaN,male

if you only want certain columns or rows .loc[] is used as well

.loc['row name start':'row name end', 'column name start':'column name end']

In [21]:
marathon.loc[5:10, 'age':'bmi']

     age        bmi
5   16.0  18.934912
6   16.0  21.153549
7   16.0  21.385611
8   16.0  22.913443
9   16.0  17.557827
10  16.0  19.858318

you can also do .loc[:6, 'bmi'] which will give all the columns up to and including six and the column you selected

In [22]:
marathon.loc[:6, 'bmi']

0    18.330755
1    19.135529
2    19.476656
3    18.330755
4    22.263451
5    18.934912
6    21.153549
Name: bmi, dtype: float64

can also do .loc[:, 'bmi':'sex']

In [23]:
marathon.loc[:,'bmi':'sex']

,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes,sex
0,18.330755,945.0,2040.0,34.000000,male
1,19.135529,1110.0,2365.0,39.416667,male
2,19.476656,985.0,2055.0,34.250000,male
3,18.330755,1146.0,NaN,NaN,male
4,22.263451,NaN,2459.0,40.983333,male
...,...,...,...,...,...
1828,19.531250,1665.0,3550.0,59.166667,female
1829,27.363125,1956.0,4014.0,66.900000,female
1830,24.431360,2280.0,NaN,NaN,female
1831,21.036816,NaN,4140.0,69.000000,female
1832,23.218958,1262.0,NaN,NaN,female

can also select using commas .loc[[5,6,10,21],['bmi','sex']]

In [24]:
marathon.loc[[5,6,10],['bmi','sex']]

          bmi   sex
5   18.934912  male
6   21.153549  male
10  19.858318  male

and also rearrange the columns the same way

In [25]:
marathon.loc[[10,6,5],['sex','bmi']]

     sex        bmi
10  male  19.858318
6   male  21.153549
5   male  18.934912

you can also assign the data frame to a new name

In [26]:
random_order = marathon.loc[[10,6,5],['sex','bmi']]
random_order

     sex        bmi
10  male  19.858318
6   male  21.153549
5   male  18.934912

if you only want a specific data field .loc[14, 'bmi']

In [27]:
marathon.loc[14, 'bmi']

23.00556564

I need to review .iloc[] - I understand that the I stands for interger, and that it counts the actual number and the number starts at 0

In [28]:
marathon.loc[14,'bmi']

23.00556564

In [30]:
marathon.iloc[14, 1]

23.00556564

okay so iloc is the same as loc when it comes to naming the row. The second number is the number location of the column.

In [31]:
marathon.iloc[[14,10,9],[1,5]]

          bmi   sex
14  23.005566  male
10  19.858318  male
9   17.557827  male

excellent- - that makes sense. IT uses the same logic as .loc

sorting values - 
for lowest rating: .sort_values(by = 'km10_time_minutes')
for highest rating: .sort_values(by= 'km10_time_minutes', ascending=False)

In [32]:
marathon.sort_values(by = 'km10_time_minutes')

,age,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes,sex
7,16.0,21.385611,1024.0,1602.0,26.700000,male
75,23.0,21.333334,912.0,1797.0,29.950000,male
13,17.0,22.263451,NaN,1813.0,30.216667,male
53,21.0,20.326448,888.0,1826.0,30.433333,male
43,20.0,19.476656,864.0,1830.0,30.500000,male
...,...,...,...,...,...,...
1821,57.0,22.549715,1400.0,NaN,NaN,female
1823,57.0,35.364986,2700.0,NaN,NaN,female
1827,59.0,20.156210,1274.0,NaN,NaN,female
1830,62.0,24.431360,2280.0,NaN,NaN,female
1832,67.0,23.218958,1262.0,NaN,NaN,female

In [35]:
marathon.sort_values(by = 'km10_time_minutes', ascending=False)

,age,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes,sex
1276,28.0,34.226562,3679.0,7085.0,118.083333,female
550,35.0,30.297020,1320.0,6420.0,107.000000,male
1443,32.0,21.484375,1927.0,6362.0,106.033333,female
1637,38.0,28.310789,NaN,6300.0,105.000000,female
227,28.0,23.569025,NaN,5640.0,94.000000,male
...,...,...,...,...,...,...
1821,57.0,22.549715,1400.0,NaN,NaN,female
1823,57.0,35.364986,2700.0,NaN,NaN,female
1827,59.0,20.156210,1274.0,NaN,NaN,female
1830,62.0,24.431360,2280.0,NaN,NaN,female
1832,67.0,23.218958,1262.0,NaN,NaN,female

if you can't get it to run check the capital in False. false does not work.

trying out .describe

In [36]:
marathon.describe()

,age,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes
count,1833.000000,1833.000000,1387.000000,946.000000,946.000000
mean,36.255046,23.783113,1402.029200,3000.086681,50.001445
std,10.082899,3.099757,325.815925,680.762376,11.346040
min,16.000000,15.428386,852.000000,1602.000000,26.700000
25%,29.000000,21.704651,1168.500000,2519.250000,41.987500
50%,34.000000,23.450836,1342.000000,2889.500000,48.158333
75%,42.000000,25.247786,1579.000000,3361.500000,56.025000
max,74.000000,47.184647,3679.000000,7085.000000,118.083333

Oh! That is some really fun data. I like it!
count: The number of non-NA/null observations.
mean: The mean of the column
std : The standard deviation of a column
min: The min value for a column
max: The max value for a column
By default the 25, 50 and 75 percentile of the observations are also included.

.describe(include='all') - includes all data fields.
unique: how many observations are unique
top: which observation value is most occurring
freq: what is the frequency of the most occurring observation

In [37]:
marathon.describe(include='all')

,age,bmi,km5_time_seconds,km10_time_seconds,km10_time_minutes,sex
count,1833.000000,1833.000000,1387.000000,946.000000,946.000000,1833
unique,NaN,NaN,NaN,NaN,NaN,2
top,NaN,NaN,NaN,NaN,NaN,male
freq,NaN,NaN,NaN,NaN,NaN,1141
mean,36.255046,23.783113,1402.029200,3000.086681,50.001445,NaN
std,10.082899,3.099757,325.815925,680.762376,11.346040,NaN
min,16.000000,15.428386,852.000000,1602.000000,26.700000,NaN
25%,29.000000,21.704651,1168.500000,2519.250000,41.987500,NaN
50%,34.000000,23.450836,1342.000000,2889.500000,48.158333,NaN
75%,42.000000,25.247786,1579.000000,3361.500000,56.025000,NaN
max,74.000000,47.184647,3679.000000,7085.000000,118.083333,NaN

frequency tables - create a data set for the column you want and use .value_counts to tally the frequency.

In [39]:
sex = marathon['sex']
sex

0         male
1         male
2         male
3         male
4         male
         ...
1828    female
1829    female
1830    female
1831    female
1832    female
Name: sex, Length: 1833, dtype: object

In [40]:
sex_freq = sex.value_counts()
sex_freq

male      1141
female     692
Name: sex, dtype: int64

.to_csv('mfr_frequency.csv', index=False)
to save a csv file? lets try

HA! It saved. I like that.

In [41]:
sex_freq.to_csv('sex_freq.csv', index=False)

altair 
import altair as alt
I cannot do this without install - will come back to this.

For now I will just use the slides until i get it installed onto VS.